uat_chat/DataProcessors/уатКалькуляторТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>уатКалькуляторТарифов</Name>
			<Comment>Калькулятор тарифов (уат)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СписокФильтров</Name>
					<Comment>Список фильтров</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>Сумма включает НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>Учитывать НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Comment>Расстояние</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаОказанияУслуги</Name>
					<Comment>Время начала оказания услуги</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияОказанияУслуги</Name>
					<Comment>Время окончания оказания услуги</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Comment>Прейскурант</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПрейскурантыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Comment>Тариф</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТарифыТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Comment>(Общ) Процент скидки (если данная скидка детализируется по позициям номенклатуры, то является значением по умолчанию)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маршруты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

uat_chat/InformationRegisters/уатПрейскурантыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатПрейскурантыТС</Name>
			<Comment>Прейскуранты на транспортные услуги (уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаКм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Услуга1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Услуга2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Услуга3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Услуга4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Услуга5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Услуга6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезПрицепа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛимитыПрейскуранта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТСнаПечать</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Прейскурант тарифов ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦехКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦехаКонтрагента</v8:Type>
						<v8:Type>cfg:CatalogRef.Месторождения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтрагентГенЗаказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/DataProcessors/уатКалькуляторТарифов/Ext/ObjectModule.bsl
Перем мТекущийПользователь;

// Рассчитывает сумму в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект       - объект редактируемого документа,
//  СпособРасчета        - "Со всеми скидками", сумма минус скидки;
//                         "Без учета ручной скидки", сумма минус автоматические скидки;
//                         "Без учета скидок", сумма (Цена * Количество);
//
Процедура мРассчитатьСумму(СтрокаТабличнойЧасти) Экспорт
		
	Если СтрокаТабличнойЧасти.Тариф.ФиксированныйТариф Тогда
		
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Тариф.Тариф;
		
	Иначе
		
		Если СтрокаТабличнойЧасти.Тариф.ПараметрВыработки = Справочники.уатПараметрыВыработки.ПробегСПассажирами Тогда
			СтрокаТабличнойЧасти.Цена = уатОбщегоНазначения.уатНайтиТариф(СтрокаТабличнойЧасти.Тариф, СтрокаТабличнойЧасти.Количество, 0, 0, 0);
		Иначе
			СтрокаТабличнойЧасти.Цена = уатОбщегоНазначения.уатНайтиТариф(СтрокаТабличнойЧасти.Тариф,0, СтрокаТабличнойЧасти.Количество, 0, 0);
		КонецЕсли;
		
	КонецЕсли;	
	
	Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
	СуммаСкидки = Сумма * СтрокаТабличнойЧасти.ПроцентСкидкиНаценки / 100;
	СтрокаТабличнойЧасти.Сумма = Сумма - СуммаСкидки;
	
КонецПроцедуры // ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти()

// Функция рассчитывает стоимость услуг
//
//В качестве формы можно передать только основную форму данной обработки
//
Функция РассчитатьСтоимостьУслугТС(Форма = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Прейскурант) Тогда
		//ищем прейскурант
		ТаблицаПрейскурант = уатОбщегоНазначения.уатНайтиПрейскурант(СписокФильтров, Истина);
		
		Если ТаблицаПрейскурант = Неопределено Тогда
			
			Если Форма <> Неопределено Тогда
				Форма.ЭлементыФормы.НадписьПрейскурант.Заголовок = "Прейскурант не найден!";
			КонецЕсли;
			
			Возврат 0;
			
		КонецЕсли;
		
		СуммаВключаетНДС = Прейскурант.СуммаВключаетНДС;
		
		//ищем прейскурант
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	уатТарифыТС.Ссылка КАК Тариф,
		|	уатТарифыТС.Владелец.Ссылка КАК Прейскурант
		|ИЗ
		|	Справочник.уатТарифыТС КАК уатТарифыТС
		|ГДЕ
		|	уатТарифыТС.Владелец.Ссылка = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец", Прейскурант);
		ТаблицаПрейскурант = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаПрейскурант.Количество() = 0 Тогда
			
			Если Форма <> Неопределено Тогда
				Форма.ЭлементыФормы.НадписьПрейскурант.Заголовок = "Действующие тарифы по прейскуранту отсутствуют!";
			КонецЕсли;
			
			Возврат 0;
			
		КонецЕсли;
	КонецЕсли;
	
	//получаем период действия актуального прейкуранта
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	уатПрейскурантыТССрезПоследних.ДатаНачала,
	|	уатПрейскурантыТССрезПоследних.ДатаОкончания
	|ИЗ
	|	РегистрСведений.уатПрейскурантыТС КАК уатПрейскурантыТССрезПоследних
	|ГДЕ
	|	(&ДатаОкончания = &ПустаяДата ИЛИ уатПрейскурантыТССрезПоследних.ДатаНачала <= &ДатаОкончания)
	|		И (&ДатаНачала = &ПустаяДата ИЛИ уатПрейскурантыТССрезПоследних.ДатаОкончания >= &ДатаНачала)
	|		И уатПрейскурантыТССрезПоследних.Прейскурант = &Прейскурант
	|УПОРЯДОЧИТЬ ПО
	|	уатПрейскурантыТССрезПоследних.ДатаНачала УБЫВ");
	Запрос.УстановитьПараметр("Прейскурант", Прейскурант);
	Запрос.УстановитьПараметр("ДатаНачала", ВремяНачалаОказанияУслуги);
	Запрос.УстановитьПараметр("ДатаОкончания", ВремяОкончанияОказанияУслуги);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		СтрПериодПрейскуранта = "";
	Иначе
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		СтрПериодПрейскуранта = Формат(Выборка.ДатаНачала, "ДФ = дд.ММ.гггг") +
			"-" + ?(Выборка.ДатаОкончания = '00010101', "...", Формат(Выборка.ДатаОкончания, "ДФ = дд.ММ.гггг"));
	КонецЕсли;
	
	Если Форма <> Неопределено Тогда
		Форма.ЭлементыФормы.НадписьПрейскурант.Заголовок = "Прейскурант № " + СокрЛП(Прейскурант.Код) + " (" + СтрПериодПрейскуранта +
		") " + СокрЛП(Прейскурант.Наименование);
	КонецЕсли;
	
	Результат = Неопределено;
	Для Каждого ВыбраннаяСтрока Из ТаблицаПрейскурант Цикл
		НоваяСтрока = Услуги.Добавить();
		НоваяСтрока.Тариф =  ВыбраннаяСтрока.Тариф;
		НоваяСтрока.Количество 	= 1; 
		НоваяСтрока.Цена 		= ВыбраннаяСтрока.Тариф.Тариф;
		НоваяСтрока.СуммаНДС	= 0;
		НоваяСтрока.СтавкаНДС	= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяСтавкаНДС");
		мРассчитатьСумму(НоваяСтрока);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЭтотОбъект);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //РасчетПрейскурантов

#Если Клиент Тогда
мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
#КонецЕсли
